#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
module.finspeed_infra.data.archive_file.api_gateway_zip: Reading...
module.finspeed_infra.data.archive_file.api_gateway_zip: Read complete after 0s [id=64c6acfea2e36bbda8aa82cafacd65849c99029a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.finspeed_infra.google_artifact_registry_repository.api will be created
  + resource "google_artifact_registry_repository" "api" {
      + create_time      = (known after apply)
      + description      = "Docker repository for the API service"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-south2"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "finspeed-staging-st"
      + repository_id    = "finspeed-api-staging"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # module.finspeed_infra.google_artifact_registry_repository.frontend will be created
  + resource "google_artifact_registry_repository" "frontend" {
      + create_time      = (known after apply)
      + description      = "Docker repository for the Frontend service"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-south2"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "finspeed-staging-st"
      + repository_id    = "finspeed-frontend-staging"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # module.finspeed_infra.google_artifact_registry_repository.migrate will be created
  + resource "google_artifact_registry_repository" "migrate" {
      + create_time      = (known after apply)
      + description      = "Docker repository for the Migrate job"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-south2"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "finspeed-staging-st"
      + repository_id    = "finspeed-migrate-staging"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # module.finspeed_infra.google_artifact_registry_repository_iam_member.api_repo_reader_cloud_run will be created
  + resource "google_artifact_registry_repository_iam_member" "api_repo_reader_cloud_run" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "asia-south2"
      + member     = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project    = "finspeed-staging-st"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.finspeed_infra.google_artifact_registry_repository_iam_member.api_repo_writer will be created
  + resource "google_artifact_registry_repository_iam_member" "api_repo_writer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "asia-south2"
      + member     = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project    = "finspeed-staging-st"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.finspeed_infra.google_artifact_registry_repository_iam_member.frontend_repo_reader_cloud_run will be created
  + resource "google_artifact_registry_repository_iam_member" "frontend_repo_reader_cloud_run" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "asia-south2"
      + member     = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project    = "finspeed-staging-st"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.finspeed_infra.google_artifact_registry_repository_iam_member.frontend_repo_writer will be created
  + resource "google_artifact_registry_repository_iam_member" "frontend_repo_writer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "asia-south2"
      + member     = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project    = "finspeed-staging-st"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.finspeed_infra.google_artifact_registry_repository_iam_member.migrate_repo_reader_cloud_run will be created
  + resource "google_artifact_registry_repository_iam_member" "migrate_repo_reader_cloud_run" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "asia-south2"
      + member     = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project    = "finspeed-staging-st"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.finspeed_infra.google_artifact_registry_repository_iam_member.migrate_repo_writer will be created
  + resource "google_artifact_registry_repository_iam_member" "migrate_repo_writer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "asia-south2"
      + member     = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project    = "finspeed-staging-st"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.finspeed_infra.google_cloud_run_v2_job.migrate will be created
  + resource "google_cloud_run_v2_job" "migrate" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + deletion_protection      = false
      + effective_annotations    = (known after apply)
      + effective_labels         = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + labels                   = {
          + "environment"  = "staging"
          + "managed-by"   = "terraform"
          + "project"      = "finspeed"
          + "validated-by" = "cascade-test"
        }
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "asia-south2"
      + name                     = "finspeed-migrate-staging"
      + observed_generation      = (known after apply)
      + project                  = "finspeed-staging-st"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = 1

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 0
              + service_account       = "finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
              + timeout               = "600s"

              + containers {
                  + args    = [
                      + "migrate",
                    ]
                  + command = [
                      + "/app/main",
                    ]
                  + image   = "asia-south2-docker.pkg.dev/finspeed-staging-st/finspeed-migrate-staging/finspeed-migrate-staging:latest"

                  + env {
                      + name  = "DATABASE_URL"
                        # (1 unchanged attribute hidden)

                      + value_source {
                          + secret_key_ref {
                              + secret  = "finspeed-database-url-staging"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name  = "MIGRATIONS_PATH"
                      + value = "file:///app/db/migrations"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }

                  + startup_probe (known after apply)
                }

              + vpc_access {
                  + connector = (known after apply)
                  + egress    = "PRIVATE_RANGES_ONLY"
                }
            }
        }
    }

  # module.finspeed_infra.google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
      + labels                  = {
          + "environment"  = "staging"
          + "managed-by"   = "terraform"
          + "project"      = "finspeed"
          + "validated-by" = "cascade-test"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-south2"
      + name                    = "finspeed-api-staging"
      + observed_generation     = (known after apply)
      + project                 = "finspeed-staging-st"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + labels                           = {
              + "environment"  = "staging"
              + "managed-by"   = "terraform"
              + "project"      = "finspeed"
              + "validated-by" = "cascade-test"
            }
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "asia-south2-docker.pkg.dev/finspeed-staging-st/finspeed-api-staging/finspeed-api-staging:latest"

              + env {
                  + name  = "DATABASE_URL"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "finspeed-database-url-staging"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "staging"
                }
              + env {
                  + name  = "LOG_LEVEL"
                  + value = "debug"
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 30
                  + period_seconds        = 30
                  + timeout_seconds       = 5

                  + http_get {
                      + path = "/healthz"
                      + port = 8080
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = true
                  + limits   = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 10
                  + period_seconds        = 10
                  + timeout_seconds       = 5

                  + http_get {
                      + path = "/healthz"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 3
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.finspeed_infra.google_cloud_run_v2_service.frontend will be created
  + resource "google_cloud_run_v2_service" "frontend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
      + labels                  = {
          + "environment"  = "staging"
          + "managed-by"   = "terraform"
          + "project"      = "finspeed"
          + "validated-by" = "cascade-test"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-south2"
      + name                    = "finspeed-frontend-staging"
      + observed_generation     = (known after apply)
      + project                 = "finspeed-staging-st"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + labels                           = {
              + "environment"  = "staging"
              + "managed-by"   = "terraform"
              + "project"      = "finspeed"
              + "validated-by" = "cascade-test"
            }
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "asia-south2-docker.pkg.dev/finspeed-staging-st/finspeed-frontend-staging/finspeed-frontend-staging:lb-path-routing-fix-1"

              + env {
                  + name  = "API_URL"
                  + value = (known after apply)
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "staging"
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 30
                  + period_seconds        = 30
                  + timeout_seconds       = 5

                  + http_get {
                      + path = "/"
                      + port = 8080
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = true
                  + limits   = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 10
                  + period_seconds        = 10
                  + timeout_seconds       = 5

                  + http_get {
                      + path = "/"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "ALL_TRAFFIC"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.finspeed_infra.google_cloud_run_v2_service_iam_member.api_iap_invoker[0] will be created
  + resource "google_cloud_run_v2_service_iam_member" "api_iap_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-south2"
      + member   = (known after apply)
      + name     = "finspeed-api-staging"
      + project  = "finspeed-staging-st"
      + role     = "roles/run.invoker"
    }

  # module.finspeed_infra.google_cloud_run_v2_service_iam_member.frontend_iap_invoker[0] will be created
  + resource "google_cloud_run_v2_service_iam_member" "frontend_iap_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-south2"
      + member   = (known after apply)
      + name     = "finspeed-frontend-staging"
      + project  = "finspeed-staging-st"
      + role     = "roles/run.invoker"
    }

  # module.finspeed_infra.google_compute_backend_service.api_backend will be created
  + resource "google_compute_backend_service" "api_backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "finspeed-api-backend-staging"
      + port_name                       = (known after apply)
      + project                         = "finspeed-staging-st"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap {
          + enabled                     = true
          + oauth2_client_id            = (known after apply)
          + oauth2_client_secret        = (sensitive value)
          + oauth2_client_secret_sha256 = (sensitive value)
        }

      + log_config (known after apply)
    }

  # module.finspeed_infra.google_compute_backend_service.api_backend_public will be created
  + resource "google_compute_backend_service" "api_backend_public" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "finspeed-api-backend-public-staging"
      + port_name                       = (known after apply)
      + project                         = "finspeed-staging-st"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap (known after apply)

      + log_config (known after apply)
    }

  # module.finspeed_infra.google_compute_backend_service.frontend_backend will be created
  + resource "google_compute_backend_service" "frontend_backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "finspeed-frontend-backend-staging"
      + port_name                       = "http"
      + project                         = "finspeed-staging-st"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap {
          + enabled                     = true
          + oauth2_client_id            = (known after apply)
          + oauth2_client_secret        = (sensitive value)
          + oauth2_client_secret_sha256 = (sensitive value)
        }

      + log_config (known after apply)
    }

  # module.finspeed_infra.google_compute_backend_service.frontend_backend_admin will be created
  + resource "google_compute_backend_service" "frontend_backend_admin" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "finspeed-frontend-admin-backend-staging"
      + port_name                       = "http"
      + project                         = "finspeed-staging-st"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap {
          + enabled                     = true
          + oauth2_client_id            = (known after apply)
          + oauth2_client_secret        = (sensitive value)
          + oauth2_client_secret_sha256 = (sensitive value)
        }

      + log_config (known after apply)
    }

  # module.finspeed_infra.google_compute_firewall.allow_health_checks will be created
  + resource "google_compute_firewall" "allow_health_checks" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "finspeed-allow-health-checks-staging"
      + network            = "finspeed-vpc-staging"
      + priority           = 1000
      + project            = "finspeed-staging-st"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]
      + target_tags        = [
          + "finspeed-web",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # module.finspeed_infra.google_compute_firewall.allow_http_https will be created
  + resource "google_compute_firewall" "allow_http_https" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "finspeed-allow-http-https-staging"
      + network            = "finspeed-vpc-staging"
      + priority           = 1000
      + project            = "finspeed-staging-st"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "finspeed-web",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # module.finspeed_infra.google_compute_firewall.allow_internal will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "finspeed-allow-internal-staging"
      + network            = "finspeed-vpc-staging"
      + priority           = 1000
      + project            = "finspeed-staging-st"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/24",
        ]
      + target_tags        = [
          + "finspeed-internal",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.finspeed_infra.google_compute_firewall.allow_ssh will be created
  + resource "google_compute_firewall" "allow_ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "finspeed-allow-ssh-staging"
      + network            = "finspeed-vpc-staging"
      + priority           = 1000
      + project            = "finspeed-staging-st"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "finspeed-ssh",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.finspeed_infra.google_compute_global_address.lb_ip will be created
  + resource "google_compute_global_address" "lb_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "finspeed-lb-ip-staging"
      + prefix_length      = (known after apply)
      + project            = "finspeed-staging-st"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.finspeed_infra.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "finspeed-private-ip-staging"
      + network            = (known after apply)
      + prefix_length      = 16
      + project            = "finspeed-staging-st"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.finspeed_infra.google_compute_global_forwarding_rule.forwarding_rule[0] will be created
  + resource "google_compute_global_forwarding_rule" "forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL_MANAGED"
      + name                  = "finspeed-forwarding-rule-staging"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "finspeed-staging-st"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.finspeed_infra.google_compute_managed_ssl_certificate.ssl_certificate[0] will be created
  + resource "google_compute_managed_ssl_certificate" "ssl_certificate" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "finspeed-staging-st"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "staging.finspeed.online",
              + "api.staging.finspeed.online",
              + "admin.staging.finspeed.online",
            ]
        }
    }

  # module.finspeed_infra.google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "finspeed-vpc-staging"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "finspeed-staging-st"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.finspeed_infra.google_compute_region_network_endpoint_group.api_neg will be created
  + resource "google_compute_region_network_endpoint_group" "api_neg" {
      + id                    = (known after apply)
      + name                  = "finspeed-api-neg-staging"
      + network_endpoint_type = "SERVERLESS"
      + project               = "finspeed-staging-st"
      + region                = "asia-south2"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "finspeed-api-staging"
        }

      + psc_data (known after apply)
    }

  # module.finspeed_infra.google_compute_region_network_endpoint_group.frontend_neg will be created
  + resource "google_compute_region_network_endpoint_group" "frontend_neg" {
      + id                    = (known after apply)
      + name                  = "finspeed-frontend-neg-staging"
      + network_endpoint_type = "SERVERLESS"
      + project               = "finspeed-staging-st"
      + region                = "asia-south2"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "finspeed-frontend-staging"
        }

      + psc_data (known after apply)
    }

  # module.finspeed_infra.google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "finspeed-subnet-staging"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "finspeed-staging-st"
      + purpose                    = (known after apply)
      + region                     = "asia-south2"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.finspeed_infra.google_compute_target_https_proxy.https_proxy[0] will be created
  + resource "google_compute_target_https_proxy" "https_proxy" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "finspeed-https-proxy-staging"
      + project            = "finspeed-staging-st"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.finspeed_infra.google_compute_url_map.url_map[0] will be created
  + resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "finspeed-lb-url-map-staging"
      + project            = "finspeed-staging-st"
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "admin.staging.finspeed.online",
            ]
          + path_matcher = "admin-matcher"
            # (1 unchanged attribute hidden)
        }
      + host_rule {
          + hosts        = [
              + "api.staging.finspeed.online",
            ]
          + path_matcher = "api-matcher"
            # (1 unchanged attribute hidden)
        }
      + host_rule {
          + hosts        = [
              + "staging.finspeed.online",
            ]
          + path_matcher = "frontend-matcher"
            # (1 unchanged attribute hidden)
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "api-matcher"
        }
      + path_matcher {
          + default_service = (known after apply)
          + name            = "admin-matcher"
        }
      + path_matcher {
          + default_service = (known after apply)
          + name            = "frontend-matcher"

          + path_rule {
              + paths   = [
                  + "/api/*",
                  + "/api/v1/*",
                ]
              + service = (known after apply)
            }
        }
    }

  # module.finspeed_infra.google_iam_workload_identity_pool.github_pool will be created
  + resource "google_iam_workload_identity_pool" "github_pool" {
      + description               = "Workload Identity Pool for GitHub Actions"
      + display_name              = "Finspeed Pool v2"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "finspeed-staging-st"
      + state                     = (known after apply)
      + workload_identity_pool_id = "finspeed-pool-v2"
    }

  # module.finspeed_infra.google_iam_workload_identity_pool_provider.github_provider will be created
  + resource "google_iam_workload_identity_pool_provider" "github_provider" {
      + attribute_condition                = "assertion.repository == 'sunderam-tripathi/finspeed' && (assertion.ref == 'refs/heads/develop' || startswith(assertion.ref, 'refs/pull/') || assertion.ref_type == 'tag')"
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.ref"        = "assertion.ref"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "OIDC identity pool provider for GitHub Actions"
      + display_name                       = "GitHub Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "finspeed-staging-st"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "finspeed-pool-v2"
      + workload_identity_pool_provider_id = "github-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.finspeed_infra.google_iap_brand.project_brand will be created
  + resource "google_iap_brand" "project_brand" {
      + application_title = "Finspeed staging"
      + id                = (known after apply)
      + name              = (known after apply)
      + org_internal_only = (known after apply)
      + project           = "finspeed-staging-st"
      + support_email     = "welcome@sunderamtripathi.com"
    }

  # module.finspeed_infra.google_iap_client.project_client will be created
  + resource "google_iap_client" "project_client" {
      + brand        = (known after apply)
      + client_id    = (known after apply)
      + display_name = "Finspeed staging Client"
      + id           = (known after apply)
      + secret       = (sensitive value)
    }

  # module.finspeed_infra.google_iap_web_backend_service_iam_member.api_iap_cicd[0] will be created
  + resource "google_iap_web_backend_service_iam_member" "api_iap_cicd" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + member              = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project             = "finspeed-staging-st"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "finspeed-api-backend-staging"
    }

  # module.finspeed_infra.google_iap_web_backend_service_iam_member.api_iap_user[0] will be created
  + resource "google_iap_web_backend_service_iam_member" "api_iap_user" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + member              = "user:welcome@sunderamtripathi.com"
      + project             = "finspeed-staging-st"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "finspeed-api-backend-staging"
    }

  # module.finspeed_infra.google_iap_web_backend_service_iam_member.frontend_iap_cicd[0] will be created
  + resource "google_iap_web_backend_service_iam_member" "frontend_iap_cicd" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + member              = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project             = "finspeed-staging-st"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "finspeed-frontend-backend-staging"
    }

  # module.finspeed_infra.google_iap_web_backend_service_iam_member.frontend_iap_user[0] will be created
  + resource "google_iap_web_backend_service_iam_member" "frontend_iap_user" {
      + etag                = (known after apply)
      + id                  = (known after apply)
      + member              = "user:welcome@sunderamtripathi.com"
      + project             = "finspeed-staging-st"
      + role                = "roles/iap.httpsResourceAccessor"
      + web_backend_service = "finspeed-frontend-backend-staging"
    }

  # module.finspeed_infra.google_monitoring_alert_policy.api_uptime_alert[0] will be created
  + resource "google_monitoring_alert_policy" "api_uptime_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Finspeed API Down Alert (staging)"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "finspeed-staging-st"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "API Uptime Check Failed"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_LT"
              + duration        = "300s"
              + filter          = "metric.type=\"monitoring.googleapis.com/uptime_check/check_passed\" AND resource.type=\"uptime_url\" AND resource.labels.project_id=\"finspeed-staging-st\""
              + threshold_value = 1

              + aggregations {
                  + alignment_period   = "300s"
                  + per_series_aligner = "ALIGN_NEXT_OLDER"
                }
            }
        }
    }

  # module.finspeed_infra.google_monitoring_alert_policy.database_connection[0] will be created
  + resource "google_monitoring_alert_policy" "database_connection" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Finspeed Database Connection Issues (staging)"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "finspeed-staging-st"

      + conditions {
          + display_name = "High Database Connection Count"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type=\"cloudsql_database\" AND resource.labels.database_id=\"finspeed-staging-st:finspeed-postgres-staging\" AND metric.type=\"cloudsql.googleapis.com/database/postgresql/num_backends\""
              + threshold_value = 80

              + aggregations {
                  + alignment_period   = "300s"
                  + per_series_aligner = "ALIGN_MEAN"
                }
            }
        }
    }

  # module.finspeed_infra.google_monitoring_alert_policy.high_error_rate[0] will be created
  + resource "google_monitoring_alert_policy" "high_error_rate" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Finspeed High Error Rate (staging)"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "finspeed-staging-st"

      + conditions {
          + display_name = "High 5xx Error Rate"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"finspeed-api-staging\" AND metric.type=\"run.googleapis.com/request_count\" AND metric.labels.response_code_class=\"5xx\""
              + threshold_value = 5

              + aggregations {
                  + alignment_period     = "300s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + per_series_aligner   = "ALIGN_RATE"
                }
            }
        }
    }

  # module.finspeed_infra.google_monitoring_alert_policy.high_latency[0] will be created
  + resource "google_monitoring_alert_policy" "high_latency" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Finspeed High Response Latency (staging)"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "finspeed-staging-st"

      + conditions {
          + display_name = "High P95 Response Latency"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"finspeed-api-staging\" AND metric.type=\"run.googleapis.com/request_latencies\""
              + threshold_value = 1000

              + aggregations {
                  + alignment_period     = "300s"
                  + cross_series_reducer = "REDUCE_PERCENTILE_95"
                  + per_series_aligner   = "ALIGN_DELTA"
                }
            }
        }
    }

  # module.finspeed_infra.google_monitoring_dashboard.finspeed_dashboard will be created
  + resource "google_monitoring_dashboard" "finspeed_dashboard" {
      + dashboard_json = jsonencode(
            {
              + displayName  = "Finspeed Dashboard (staging)"
              + mosaicLayout = {
                  + columns = 12
                  + tiles   = [
                      + {
                          + height = 4
                          + widget = {
                              + title   = "API Request Rate"
                              + xyChart = {
                                  + dataSets          = [
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_SUM"
                                                      + perSeriesAligner   = "ALIGN_RATE"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"finspeed-api-staging\" AND metric.type=\"run.googleapis.com/request_count\""
                                                }
                                            }
                                        },
                                    ]
                                  + timeshiftDuration = "0s"
                                  + yAxis             = {
                                      + label = "Requests/sec"
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "API Response Latency (P95)"
                              + xyChart = {
                                  + dataSets          = [
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_95"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"finspeed-api-staging\" AND metric.type=\"run.googleapis.com/request_latencies\""
                                                }
                                            }
                                        },
                                    ]
                                  + timeshiftDuration = "0s"
                                  + yAxis             = {
                                      + label = "Latency (ms)"
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                          + xPos   = 6
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Database Connections"
                              + xyChart = {
                                  + dataSets          = [
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod  = "60s"
                                                      + perSeriesAligner = "ALIGN_MEAN"
                                                    }
                                                  + filter      = "resource.type=\"cloudsql_database\" AND resource.labels.database_id=\"finspeed-staging-st:finspeed-postgres-staging\" AND metric.type=\"cloudsql.googleapis.com/database/postgresql/num_backends\""
                                                }
                                            }
                                        },
                                    ]
                                  + timeshiftDuration = "0s"
                                  + yAxis             = {
                                      + label = "Connections"
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                          + yPos   = 4
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Error Rate by Response Code"
                              + xyChart = {
                                  + dataSets          = [
                                      + {
                                          + plotType        = "STACKED_AREA"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_SUM"
                                                      + groupByFields      = [
                                                          + "metric.label.response_code_class",
                                                        ]
                                                      + perSeriesAligner   = "ALIGN_RATE"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"finspeed-api-staging\" AND metric.type=\"run.googleapis.com/request_count\""
                                                }
                                            }
                                        },
                                    ]
                                  + timeshiftDuration = "0s"
                                  + yAxis             = {
                                      + label = "Requests/sec"
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                          + xPos   = 6
                          + yPos   = 4
                        },
                    ]
                }
            }
        )
      + id             = (known after apply)
      + project        = "finspeed-staging-st"
    }

  # module.finspeed_infra.google_monitoring_notification_channel.email[0] will be created
  + resource "google_monitoring_notification_channel" "email" {
      + display_name        = "Finspeed Email Notifications (staging)"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "welcome@sunderamtripathi.com"
        }
      + name                = (known after apply)
      + project             = "finspeed-staging-st"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # module.finspeed_infra.google_monitoring_uptime_check_config.api_uptime_check[0] will be created
  + resource "google_monitoring_uptime_check_config" "api_uptime_check" {
      + checker_type     = (known after apply)
      + display_name     = "Finspeed API Uptime Check (staging)"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "60s"
      + project          = "finspeed-staging-st"
      + selected_regions = [
          + "USA",
          + "EUROPE",
          + "ASIA_PACIFIC",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + content_matchers {
          + content = "\"status\":\"healthy\""
          + matcher = "CONTAINS_STRING"
        }

      + http_check {
          + headers        = (known after apply)
          + path           = "/healthz"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = (known after apply)
          + type   = "uptime_url"
        }
    }

  # module.finspeed_infra.google_monitoring_uptime_check_config.frontend_uptime_check[0] will be created
  + resource "google_monitoring_uptime_check_config" "frontend_uptime_check" {
      + checker_type     = (known after apply)
      + display_name     = "Finspeed Frontend Uptime Check (staging)"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "60s"
      + project          = "finspeed-staging-st"
      + selected_regions = [
          + "USA",
          + "EUROPE",
          + "ASIA_PACIFIC",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = (known after apply)
          + type   = "uptime_url"
        }
    }

  # module.finspeed_infra.google_project_iam_member.cloud_run_sa_permissions["roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "cloud_run_sa_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/cloudsql.client"
    }

  # module.finspeed_infra.google_project_iam_member.cloud_run_sa_permissions["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "cloud_run_sa_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/cloudtrace.agent"
    }

  # module.finspeed_infra.google_project_iam_member.cloud_run_sa_permissions["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "cloud_run_sa_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/logging.logWriter"
    }

  # module.finspeed_infra.google_project_iam_member.cloud_run_sa_permissions["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "cloud_run_sa_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.finspeed_infra.google_project_iam_member.cloud_run_sa_permissions["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "cloud_run_sa_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/artifactregistry.admin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/artifactregistry.admin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/cloudbuild.builds.builder"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/cloudbuild.builds.builder"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/cloudsql.admin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/cloudsql.admin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/cloudsql.client"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/compute.networkAdmin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/compute.networkAdmin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/compute.securityAdmin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/compute.securityAdmin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/editor"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/editor"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/iap.admin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/iap.admin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/monitoring.admin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/monitoring.admin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/resourcemanager.projectIamAdmin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/run.admin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/run.admin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/secretmanager.admin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/secretmanager.admin"
    }

  # module.finspeed_infra.google_project_iam_member.github_actions_permissions["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + project = "finspeed-staging-st"
      + role    = "roles/storage.admin"
    }

  # module.finspeed_infra.google_project_service.artifact_registry_api will be created
  + resource "google_project_service" "artifact_registry_api" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.iam_api will be created
  + resource "google_project_service" "iam_api" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["cloudfunctions.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "cloudfunctions.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["compute.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "compute.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["iam.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "iam.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["iap.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "iap.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "monitoring.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["run.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "run.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "sqladmin.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["storage.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "storage.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["sts.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "sts.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.required_apis["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.finspeed_infra.google_project_service.sts_api will be created
  + resource "google_project_service" "sts_api" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "finspeed-staging-st"
      + service                    = "sts.googleapis.com"
    }

  # module.finspeed_infra.google_project_service_identity.iap_service_account will be created
  + resource "google_project_service_identity" "iap_service_account" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "finspeed-staging-st"
      + service = "iap.googleapis.com"
    }

  # module.finspeed_infra.google_secret_manager_secret.database_password will be created
  + resource "google_secret_manager_secret" "database_password" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "environment"  = "staging"
          + "managed-by"   = "terraform"
          + "project"      = "finspeed"
          + "validated-by" = "cascade-test"
        }
      + name                  = (known after apply)
      + project               = "finspeed-staging-st"
      + secret_id             = "finspeed-database-password-staging"
      + terraform_labels      = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.finspeed_infra.google_secret_manager_secret.database_url will be created
  + resource "google_secret_manager_secret" "database_url" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "environment"  = "staging"
          + "managed-by"   = "terraform"
          + "project"      = "finspeed"
          + "validated-by" = "cascade-test"
        }
      + name                  = (known after apply)
      + project               = "finspeed-staging-st"
      + secret_id             = "finspeed-database-url-staging"
      + terraform_labels      = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "project"                    = "finspeed"
          + "validated-by"               = "cascade-test"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.finspeed_infra.google_secret_manager_secret_version.database_password will be created
  + resource "google_secret_manager_secret_version" "database_password" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.finspeed_infra.google_secret_manager_secret_version.database_url will be created
  + resource "google_secret_manager_secret_version" "database_url" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.finspeed_infra.google_service_account.cloud_run_sa will be created
  + resource "google_service_account" "cloud_run_sa" {
      + account_id   = "finspeed-cloud-run-staging"
      + description  = "Service account for Finspeed Cloud Run services in staging"
      + disabled     = false
      + display_name = "Finspeed Cloud Run Service Account (staging)"
      + email        = "finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:finspeed-cloud-run-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "finspeed-staging-st"
      + unique_id    = (known after apply)
    }

  # module.finspeed_infra.google_service_account.github_actions will be created
  + resource "google_service_account" "github_actions" {
      + account_id   = "github-actions-staging"
      + description  = "Service account for GitHub Actions CI/CD pipeline"
      + disabled     = false
      + display_name = "GitHub Actions Service Account (staging)"
      + email        = "github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "finspeed-staging-st"
      + unique_id    = (known after apply)
    }

  # module.finspeed_infra.google_service_account_iam_binding.github_actions_token_creator will be created
  + resource "google_service_account_iam_binding" "github_actions_token_creator" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.finspeed_infra.google_service_account_iam_member.github_actions_workload_identity will be created
  + resource "google_service_account_iam_member" "github_actions_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.finspeed_infra.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "finspeed-private-ip-staging",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.finspeed_infra.google_sql_database.finspeed_database will be created
  + resource "google_sql_database" "finspeed_database" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "finspeed-postgres-staging"
      + name            = "finspeed_staging"
      + project         = "finspeed-staging-st"
      + self_link       = (known after apply)
    }

  # module.finspeed_infra.google_sql_database_instance.postgres will be created
  + resource "google_sql_database_instance" "postgres" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "finspeed-postgres-staging"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "finspeed-staging-st"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-south2"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 100
          + disk_size                   = 20
          + disk_type                   = "PD_SSD"
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + point_in_time_recovery_enabled = false
              + start_time                     = "03:00"
              + transaction_log_retention_days = 3

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + insights_config {
              + query_insights_enabled  = true
              + query_plans_per_minute  = 5
              + query_string_length     = 1024
              + record_application_tags = true
              + record_client_address   = true
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = "ENCRYPTED_ONLY"
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 4
              + update_track = "stable"
            }
        }
    }

  # module.finspeed_infra.google_sql_user.finspeed_user will be created
  + resource "google_sql_user" "finspeed_user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "finspeed-postgres-staging"
      + name                    = "finspeed_user"
      + password                = (sensitive value)
      + password_wo             = (write-only attribute)
      + project                 = "finspeed-staging-st"
      + sql_server_user_details = (known after apply)
    }

  # module.finspeed_infra.google_vpc_access_connector.connector will be created
  + resource "google_vpc_access_connector" "connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.8.0.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = (known after apply)
      + max_throughput     = 300
      + min_instances      = (known after apply)
      + min_throughput     = 200
      + name               = "finspeed-vpc-staging"
      + network            = "finspeed-vpc-staging"
      + project            = "finspeed-staging-st"
      + region             = "asia-south2"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

  # module.finspeed_infra.random_id.cert_suffix will be created
  + resource "random_id" "cert_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.finspeed_infra.random_password.database_password will be created
  + resource "random_password" "database_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 102 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_actions_service_account = "github-actions-staging@finspeed-staging-st.iam.gserviceaccount.com"
  + workload_identity_provider     = (known after apply)

Warning: Deprecated Resource

  with module.finspeed_infra.google_iap_brand.project_brand,
  on ../iap.tf line 9, in resource "google_iap_brand" "project_brand":
   9: resource "google_iap_brand" "project_brand" {

after July 2025, the `google_iap_brand` Terraform resource will no longer
function as intended due to the deprecation of the IAP OAuth Admin API

(and one more similar warning elsewhere)
```

</details>